stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_pwr_ex.h
/**
  ******************************************************************************
  * @file    stm32wbaxx_hal_pwr_ex.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WBAxx_HAL_PWR_EX_H
#define STM32WBAxx_HAL_PWR_EX_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_hal_def.h"

/** @addtogroup STM32WBAxx_HAL_Driver
  * @{
  */

/** @addtogroup PWREx
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup PWREx_Exported_Types PWR Extended Exported Types
  * @{
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup PWREx_Exported_Constants PWR Extended Exported Constants
  * @{
  */

/** @defgroup PWREx_RAM_Contents_Stop_Retention PWR Extended SRAM Contents Stop Retention
  * @{
  */
/* SRAM1 pages retention defines */
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
#define PWR_SRAM1_PAGE1_STOP_RETENTION       PWR_CR2_SRAM1PDS1                       /*!< SRAM1 page 1 retention in Stop mode */
#define PWR_SRAM1_PAGE2_STOP_RETENTION       PWR_CR2_SRAM1PDS2                       /*!< SRAM1 page 2 retention in Stop mode */
#define PWR_SRAM1_PAGE3_STOP_RETENTION       PWR_CR2_SRAM1PDS3                       /*!< SRAM1 page 3 retention in Stop mode */
#define PWR_SRAM1_PAGE4_STOP_RETENTION       PWR_CR2_SRAM1PDS4                       /*!< SRAM1 page 4 retention in Stop mode */
#define PWR_SRAM1_PAGE567_STOP_RETENTION     PWR_CR2_SRAM1PDS567                     /*!< SRAM1 page 5-6-7 retention in Stop mode */
#define PWR_SRAM1_FULL_STOP_RETENTION        (PWR_CR2_SRAM1PDS1 |PWR_CR2_SRAM1PDS2 |PWR_CR2_SRAM1PDS3 |\
                                              PWR_CR2_SRAM1PDS4 | PWR_CR2_SRAM1PDS567)
#else
#define PWR_SRAM1_FULL_STOP_RETENTION        PWR_CR2_SRAM1PDS1     /*!< SRAM1 full retention in Stop modes */
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */

/* SRAM2 pages retention defines */
#if defined(PWR_STOP3_SUPPORT)
#define PWR_SRAM2_PAGE1_STOP_RETENTION       PWR_CR2_SRAM2PDS1                        /*!< SRAM2 page1 retention in Stop modes */
#define PWR_SRAM2_PAGE2_STOP_RETENTION       PWR_CR2_SRAM2PDS2                        /*!< SRAM2 page2 retention in Stop modes */
#define PWR_SRAM2_FULL_STOP_RETENTION        (PWR_CR2_SRAM2PDS1 | PWR_CR2_SRAM2PDS2)  /*!< SRAM2 full retention in Stop modes  */
#else
#define PWR_SRAM2_FULL_STOP_RETENTION        PWR_CR2_SRAM2PDS1     /*!< SRAM2 full retention in Stop modes */
#endif /* !defined(PWR_STOP3_SUPPORT) */

#if defined (PWR_CR2_ICRAMPDS)
/* Cache RAMs retention defines */
#define PWR_ICACHE_FULL_STOP_RETENTION       PWR_CR2_ICRAMPDS      /*!< ICACHE SRAM retention in Stop modes */
#endif /* PWR_CR2_ICRAMPDS */

#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
/* USB_OTG_HS SRAM power-down in Stop modes */
#define PWR_USB_OTG_HS_SRAM_STOP_RETENTION   PWR_CR2_PRAMPDS      /*!< USB_OTG_HS SRAM content retained in Stop modes */
#endif /* defined(USB_OTG_HS) */

/* PKA SRAM power-down in Stop modes */
#define PWR_PKA_SRAM_STOP_RETENTION          PWR_CR2_PKARAMPDS    /*!< PKA SRAM content retained in Stop modes */
#endif /* defined(PWR_STOP2_SUPPORT) */
/**
  * @}
  */


/** @defgroup PWREx_RAM_Contents_Standby_Retention PWR Extended SRAM Contents Standby Retention
  * @{
  */
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
#define PWR_SRAM1_PAGE1_STANDBY_RETENTION       PWR_CR1_R1RSB1                       /*!< SRAM1 page 1 retention in Standby mode */
#define PWR_SRAM1_PAGE2_STANDBY_RETENTION       PWR_CR1_R1RSB2                       /*!< SRAM1 page 2 retention in Standby mode */
#define PWR_SRAM1_PAGE3_STANDBY_RETENTION       PWR_CR1_R1RSB3                       /*!< SRAM1 page 3 retention in Standby mode */
#define PWR_SRAM1_PAGE4_STANDBY_RETENTION       PWR_CR1_R1RSB4                       /*!< SRAM1 page 4 retention in Standby mode */
#define PWR_SRAM1_PAGE567_STANDBY_RETENTION     PWR_CR1_R1RSB567                     /*!< SRAM1 page 5-6-7 retention in Standby mode */
#define PWR_SRAM1_FULL_STANDBY_RETENTION        (PWR_CR1_R1RSB1 |PWR_CR1_R1RSB2 | PWR_CR1_R1RSB3 |\
                                                 PWR_CR1_R1RSB4 | PWR_CR1_R1RSB567)  /*!< SRAM1 full retention in Standby mode        */
#else
#define PWR_SRAM1_FULL_STANDBY_RETENTION        PWR_CR1_R1RSB1      /*!< SRAM1 full retention in Standby mode      */
#endif /* defined(PWR_STOP2_SUPPORT) */

#if defined(PWR_STOP3_SUPPORT)
#define PWR_SRAM2_PAGE1_STANDBY_RETENTION       PWR_CR1_R2RSB1                      /*!< SRAM2 page 1 retention in Standby mode      */
#define PWR_SRAM2_PAGE2_STANDBY_RETENTION       PWR_CR1_R2RSB2                      /*!< SRAM2 page 2 retention in Standby mode      */
#define PWR_SRAM2_FULL_STANDBY_RETENTION        (PWR_CR1_R2RSB1 |  PWR_CR1_R2RSB2)  /*!< SRAM2 full retention in Standby mode      */
#else
#define PWR_SRAM2_FULL_STANDBY_RETENTION        PWR_CR1_R2RSB1      /*!< SRAM2 full retention in Standby mode      */
#endif /* defined(PWR_STOP3_SUPPORT) */
#define PWR_RADIOSRAM_FULL_STANDBY_RETENTION    PWR_CR1_RADIORSB    /*!< 2.4GHz RADIO SRAMs (TXRX and Sequence)
                                                                         and Sleep clock retention in Standby mode */
/**
  * @}
  */

#if defined(PWR_CR3_REGSEL)
/** @defgroup PWREx_Supply_Configuration PWR Extended Supply Configuration
  * @{
  */
#define PWR_LDO_SUPPLY                      (0U)            /* LDO supply  */
#define PWR_SMPS_SUPPLY                     PWR_CR3_REGSEL  /* SMPS supply */
/**
  * @}
  */
#endif /* defined(PWR_CR3_REGSEL) */

/** @defgroup PWREx_Regulator_Voltage_Scale PWR Extended Regulator Voltage Scale
  * @{
  */
#if defined(PWR_STOP3_SUPPORT)
#define PWR_REGULATOR_VOLTAGE_SCALE1     PWR_VOSR_VOS_0     /*!< Voltage scaling range 1    */
#define PWR_REGULATOR_VOLTAGE_SCALE1_5   PWR_VOSR_VOS_1     /*!< Voltage scaling range 1.5  */
#define PWR_REGULATOR_VOLTAGE_SCALE2     (0U)               /*!< Voltage scaling range 2    */
#else
#define PWR_REGULATOR_VOLTAGE_SCALE1     PWR_VOSR_VOS       /*!< Voltage scaling range 1 */
#define PWR_REGULATOR_VOLTAGE_SCALE2     (0U)               /*!< Voltage scaling range 2 */
#endif /* defined(PWR_STOP3_SUPPORT) */
/**
  * @}
  */

/** @defgroup PWREx_GPIO_Port PWR Extended GPIO Port
  * @{
  */
#define PWR_GPIO_A (0x00U) /*!< GPIO port A */
#define PWR_GPIO_B (0x01U) /*!< GPIO port B */
#define PWR_GPIO_C (0x02U) /*!< GPIO port C */
#if defined(PWR_STOP2_SUPPORT)
#if defined(GPIOD)
#define PWR_GPIO_D (0x03U) /*!< GPIO port D */
#endif /* defined(GPIOD) */
#if defined(GPIOE)
#define PWR_GPIO_E (0x04U) /*!< GPIO port E */
#endif /* defined(GPIOE) */
#if defined(GPIOG)
#define PWR_GPIO_G (0x06U) /*!< GPIO port G */
#endif /* defined(GPIOG) */
#endif /* defined(PWR_STOP2_SUPPORT) */
#define PWR_GPIO_H (0x07U) /*!< GPIO port H */
/**
  * @}
  */

/** @defgroup PWREx_GPIO_Pin_Mask PWR Extended GPIO Pin Mask
  * @{
  */
#define PWR_GPIO_BIT_0      (0x00001U) /*!< GPIO port I/O pin 0  */
#define PWR_GPIO_BIT_1      (0x00002U) /*!< GPIO port I/O pin 1  */
#define PWR_GPIO_BIT_2      (0x00004U) /*!< GPIO port I/O pin 2  */
#define PWR_GPIO_BIT_3      (0x00008U) /*!< GPIO port I/O pin 3  */
#define PWR_GPIO_BIT_4      (0x00010U) /*!< GPIO port I/O pin 4  */
#define PWR_GPIO_BIT_5      (0x00020U) /*!< GPIO port I/O pin 5  */
#define PWR_GPIO_BIT_6      (0x00040U) /*!< GPIO port I/O pin 6  */
#define PWR_GPIO_BIT_7      (0x00080U) /*!< GPIO port I/O pin 7  */
#define PWR_GPIO_BIT_8      (0x00100U) /*!< GPIO port I/O pin 8  */
#define PWR_GPIO_BIT_9      (0x00200U) /*!< GPIO port I/O pin 9  */
#define PWR_GPIO_BIT_10     (0x00400U) /*!< GPIO port I/O pin 10 */
#define PWR_GPIO_BIT_11     (0x00800U) /*!< GPIO port I/O pin 11 */
#define PWR_GPIO_BIT_12     (0x01000U) /*!< GPIO port I/O pin 12 */
#define PWR_GPIO_BIT_13     (0x02000U) /*!< GPIO port I/O pin 13 */
#define PWR_GPIO_BIT_14     (0x04000U) /*!< GPIO port I/O pin 14 */
#define PWR_GPIO_BIT_15     (0x08000U) /*!< GPIO port I/O pin 15 */
#define PWR_GPIO_PIN_MASK   (0x0FFFFU)
/**
  * @}
  */

