stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_pwr_ex.h
/* GPIO port check macro */
#if defined(PWR_STOP2_SUPPORT)
#if defined(PWR_GPIO_D)
#if defined(PWR_GPIO_E) && defined(PWR_GPIO_G)
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_D) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_E) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_G) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#elif defined(PWR_GPIO_E)
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_D) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_E) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#elif defined(PWR_GPIO_G)
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_D) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_G) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#else /* No PWR_GPIO_E and PWR_GPIO_G */
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_D) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#endif /* PWR_GPIO_E */
#else /* No PWR_GPIO_D */
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#endif /* PWR_GPIO_D */
#else
#define IS_PWR_GPIO_PORT(GPIO_PORT)              (((GPIO_PORT) == PWR_GPIO_A) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_B) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_C) ||\
                                                  ((GPIO_PORT) == PWR_GPIO_H))
#endif /* defined(PWR_STOP2_SUPPORT) */

/* GPIO pin mask check macro */
#define IS_PWR_GPIO_PIN_MASK(BIT_MASK)           ((((BIT_MASK) & PWR_GPIO_PIN_MASK) != 0U) &&\
                                                  ((BIT_MASK) <= PWR_GPIO_PIN_MASK))

/* SRAM1 retention in Standby mode check macro */
#if defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT)
#define IS_PWR_SRAM1_STANDBY_RETENTION(CONTENT)  (((CONTENT) == PWR_SRAM1_PAGE1_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM1_PAGE2_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM1_PAGE3_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM1_PAGE4_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM1_PAGE567_STANDBY_RETENTION) ||\
                                                  ((CONTENT) == PWR_SRAM1_FULL_STANDBY_RETENTION))
#else
#define IS_PWR_SRAM1_STANDBY_RETENTION(CONTENT)  ((CONTENT) == PWR_SRAM1_FULL_STANDBY_RETENTION)
#endif /* defined(PWR_STOP2_SUPPORT) && !defined(PWR_STOP3_SUPPORT) */

/* SRAM2 retention in Standby mode check macro */
#if defined(PWR_STOP3_SUPPORT)
#define IS_PWR_SRAM2_STANDBY_RETENTION(CONTENT)  (((CONTENT) == PWR_SRAM2_PAGE1_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM2_PAGE2_STANDBY_RETENTION)   ||\
                                                  ((CONTENT) == PWR_SRAM2_FULL_STANDBY_RETENTION))
#else
#define IS_PWR_SRAM2_STANDBY_RETENTION(CONTENT)  ((CONTENT) == PWR_SRAM2_FULL_STANDBY_RETENTION)
#endif /* defined(PWR_STOP3_SUPPORT) */

/* RADIO SRAM retention in Standby mode check macro */
#define IS_PWR_RADIOSRAM_STANDBY_RETENTION(CONTENT)  ((CONTENT) == PWR_RADIOSRAM_FULL_STANDBY_RETENTION)

/* RAMs retention in Stop mode check macro */
#if defined(PWR_STOP2_SUPPORT)
#if defined(USB_OTG_HS)
#define IS_PWR_RAM_STOP_RETENTION(RAMCONTENT)    (((RAMCONTENT) == PWR_SRAM1_PAGE1_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE2_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE3_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE4_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE567_STOP_RETENTION) ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_ICACHE_FULL_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_USB_OTG_HS_SRAM_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_PKA_SRAM_STOP_RETENTION))
#else
#if   defined(PWR_STOP3_SUPPORT)
#define IS_PWR_RAM_STOP_RETENTION(RAMCONTENT)    (((RAMCONTENT) == PWR_SRAM1_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_PAGE1_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_PAGE2_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_PKA_SRAM_STOP_RETENTION))
#else
#define IS_PWR_RAM_STOP_RETENTION(RAMCONTENT)    (((RAMCONTENT) == PWR_SRAM1_PAGE1_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE2_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE3_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE4_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_PAGE567_STOP_RETENTION) ||\
                                                  ((RAMCONTENT) == PWR_SRAM1_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_FULL_STOP_RETENTION)    ||\
                                                  ((RAMCONTENT) == PWR_ICACHE_FULL_STOP_RETENTION)   ||\
                                                  ((RAMCONTENT) == PWR_PKA_SRAM_STOP_RETENTION))
#endif /* defined(PWR_STOP3_SUPPORT) */
#endif /* defined(USB_OTG_HS) */
#else
#define IS_PWR_RAM_STOP_RETENTION(RAMCONTENT)    (((RAMCONTENT) == PWR_SRAM1_FULL_STOP_RETENTION) ||\
                                                  ((RAMCONTENT) == PWR_SRAM2_FULL_STOP_RETENTION) ||\
                                                  ((RAMCONTENT) == PWR_ICACHE_FULL_STOP_RETENTION))
#endif /* defined(PWR_STOP2_SUPPORT) */
#if defined(PWR_STOP2_SUPPORT)
/* Vdd11 USB switch delay check macro */
#define IS_PWR_VDD11USB_SWITCH_DELAY(DELAY)      ((DELAY) <= 1023U)
#endif /* defined(PWR_STOP2_SUPPORT) */
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions PWR Extended Exported Functions
  * @{
  */

